name: "CaffeNet"
layer {
  name: 'data'
  type: 'Python'
  top: 'data'
  top: 'gt_rois'
  top: 'gt_labels'
  top: 'gt_sublabels'
  top: 'gt_overlaps'
  top: 'boxes_grid'
  python_param {
    module: 'gt_data_layer.layer'
    layer: 'GtDataLayer'
    param_str: "'num_classes': 2"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    pad: 5
    stride: 4
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    pad: 2
    group: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    group: 2
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    group: 2
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "conv_sub"
  type: "Convolution"
  bottom: "conv5"
  top: "conv_sub"
  param {
    name: "conv_sub_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv_sub_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 126
    kernel_size: 5
    pad: 2
  }
}
layer {
  name: 'roi'
  type: 'Python'
  bottom: 'conv_sub'
  bottom: 'gt_rois'
  bottom: 'gt_labels'
  bottom: 'gt_sublabels'
  bottom: 'gt_overlaps'
  bottom: 'boxes_grid'
  top: 'rois'
  top: 'labels'
  top: 'bbox_targets'
  top: 'bbox_loss_weights'
  top: 'sublabels'
  python_param {
    module: 'roi_generating_layer.layer'
    layer: 'RoIGeneratingLayer'
    param_str: "'num_classes': 2\n'kernel_size': 5\n'spatial_scale': 0.0625"
  }
}
layer {
  name: "roi_pool5"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "rois"
  top: "pool5"
  roi_pooling_param {
    pooled_w: 5
    pooled_h: 5
    spatial_scale: 0.0625 # 1/16
  }
}
layer {
  name: "conv_sub_pool"
  type: "Convolution"
  bottom: "pool5"
  top: "subcls_score"
  param {
    name: "conv_sub_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv_sub_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 126
    kernel_size: 5 
  }
}
layer {
  name: "loss_subcls"
  type: "SoftmaxWithLoss"
  bottom: "subcls_score"
  bottom: "sublabels"
  top: "loss_subcls"
  loss_weight: 1
}
layer {
  name: "fc6_scratch"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6_scratch"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
  }
}
layer {
  name: "relu6_scratch"
  type: "ReLU"
  bottom: "fc6_scratch"
  top: "fc6_scratch"
}
layer {
  name: "drop6_scratch"
  type: "Dropout"
  bottom: "fc6_scratch"
  top: "fc6_scratch"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_scratch"
  type: "InnerProduct"
  bottom: "fc6_scratch"
  top: "fc7_scratch"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
  }
}
layer {
  name: "relu7_scratch"
  type: "ReLU"
  bottom: "fc7_scratch"
  top: "fc7_scratch"
}
layer {
  name: "drop7_scratch"
  type: "Dropout"
  bottom: "fc7_scratch"
  top: "fc7_scratch"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_score"
  type: "InnerProduct"
  bottom: "fc7_scratch"
  top: "cls_score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7_scratch"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 8 
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_cls"
  type: "SoftmaxWithLoss"
  bottom: "cls_score"
  bottom: "labels"
  top: "loss_cls"
  loss_weight: 1
}
layer {
  name: "loss_bbox"
  type: "SmoothL1Loss"
  bottom: "bbox_pred"
  bottom: "bbox_targets"
  bottom: "bbox_loss_weights"
  top: "loss_bbox"
  loss_weight: 1
}
