name: "CaffeNet"
layer {
  name: 'data'
  type: 'Python'
  top: 'data'
  top: 'info_boxes'
  top: 'parameters'
  python_param {
    module: 'gt_data_layer.layer'
    layer: 'GtDataLayer'
    param_str: "'num_classes': 4"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    pad: 5
    stride: 4
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    pad: 2
    group: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    group: 2
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    group: 2
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: 'feature'
  type: 'FeatureExtrapolating'
  bottom: 'conv5'
  top: 'conv5_feature'
  feature_extrapolating_param {
    scale_string: "0.25 0.5 1.0 2.0 3.0"
    num_scale_base: 5
    num_per_octave: 4 
  }
}
layer {
  name: "conv_sub"
  type: "Convolution"
  bottom: "conv5_feature"
  top: "conv_sub"
  param {
    name: "conv_sub_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv_sub_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 221  # 220 + 1
    kernel_size: 5
    pad: 2
  }
}
layer {
  name: "conv_sub_prob"
  type: "Softmax"
  bottom: "conv_sub"
  top: "conv_sub_prob"
}
layer {
  name: 'heatmap'
  type: 'HeatmapGenerating'
  bottom: 'conv_sub_prob'
  top: 'heatmap'
}
layer {
  name: 'roi'
  type: 'ROIGenerating'
  bottom: 'heatmap'
  bottom: 'info_boxes'
  bottom: 'parameters'
  top: 'rois_sub'
  top: 'sublabels'
  top: 'bbox_targets'
  top: 'bbox_inside_weights'
  top: 'bbox_outside_weights'
  roi_generating_param {
    flag_proposal_only: 1
    batch_size: 128
    num_classes: 4
    fg_fraction: 0.5
    spatial_scale: 0.0625 # 1/16
  }
}
#layer {
#  name: 'roi_visualizing'
#  type: 'Python'
#  bottom: 'rois_sub'
#  bottom: 'data'
#  python_param {
#    module: 'roi_visualizing_layer.layer'
#    layer: 'RoIVisualizingLayer'
#  }
#}
layer {
  name: "roi_pool5_sub"
  type: "ROIPooling"
  bottom: "conv5_feature"
  bottom: "rois_sub"
  top: "pool5_sub"
  roi_pooling_param {
    pooled_w: 5
    pooled_h: 5
    spatial_scale: 0.0625 # 1/16
  }
}
layer {
  name: "conv_sub_pool"
  type: "Convolution"
  bottom: "pool5_sub"
  top: "subcls_score"
  param {
    name: "conv_sub_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv_sub_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 221  # 220 + 1
    kernel_size: 5 
  }
}
layer {
  name: "loss_subcls"
  type: "SoftmaxWithLoss"
  bottom: "subcls_score"
  bottom: "sublabels"
  top: "loss_subcls"
  loss_weight: 1
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "pool5_sub"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16 
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_bbox"
  type: "SmoothL1Loss"
  bottom: "bbox_pred"
  bottom: "bbox_targets"
  bottom: "bbox_inside_weights"
  bottom: "bbox_outside_weights"
  top: "loss_bbox"
  loss_weight: 1
}

#========= RCNN ============
# Dummy layers so that initial parameters are saved into the output net

layer {
  name: "dummy_roi_pool_conv5"
  type: "DummyData"
  top: "dummy_roi_pool_conv5"
  dummy_data_param {
    shape { dim: 1 dim: 9216 }
    data_filler { type: "gaussian" std: 0.01 }
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "dummy_roi_pool_conv5"
  top: "fc6"
  param { lr_mult: 0 decay_mult: 0 }
  param { lr_mult: 0 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param { lr_mult: 0 decay_mult: 0 }
  param { lr_mult: 0 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "silence_fc7"
  type: "Silence"
  bottom: "fc7"
}
